# Задание 7. Уровень - ну просто прекрасный человек V2.
# Условие: решение прошлой задачи показалось Вам малоэффективным и Вы решили ускорить его до невообразимого.
# Поэтому было решено переписать решение на языке С++.



# Входные данные : натуральное число N - количество реплик в разговоре Юры и собеседника. Затем идут N реплик.
# Юра всегда начинает беседу первым, затем собеседник, затем Юра и т.д.

# Выходные данные : строка вида "Сослан на Плутон Юра" - если непалиндромная фраза впервые прозвучала у Юры,
# "Сослан на Плутон собеседник" - если непалиндромная фраза впервые прозвучала у собеседника,
# "Сослать обоих" - в случае, если все реплики были палиндромные , но ибо нечего тратить Ваше бесценное время.

# Пример:
# Ввод                                                         Вывод
# 4
# Ешь немытого ты меньше!
# Знамо, даже у ежа дома НЗ.
# И не татар костит Сократ, а тени.
# Вот же засада                                               Сослан на Плутон собеседник


# 1
# Ну хватит                                                   Сослан на Плутон Юра

# 3
# Я сличил то и то - вот и отличился.
# Болит и лоб.
# Вот не мила с алиментов.                                    Сослать обоих