# Задание 4. Уровень - в душе филантроп, в сердце фермер.
# Условие: Вы просто сказочно богаты. Ваши бизнесы по продаже круассанов в школьной столовке 
# и ресторан в Круас-виле приносят хороший доход. Но на этом Ваша душа не остановилась и Вы решили
# приложить руку и к сельскому хозяйству.
# Но вот незадача - все фермы находятся в ужасном состоянии.
# Благо, что для восстановления сельского хозяйства государство выделяет 
# целевые субсидии на покупку скота начинающим фермерам. Выделяемая сумма определяется для 
# каждого региона отдельно, при этом устанавливается точное количество голов скота, 
# которое надо приобрести. Цены следующие: бык – 20 тыс. рублей, корова - 10 тыс. рублей, 
# а теленок – 5 тыс. рублей. Выделяемую сумму необходимо потратить полностью, иначе финансы сгорят.

# Выведите все возможные варианты стада, которое вы можете купить  на эту сумму. 
# Обратите внимание, что для развития хозяйства необходимо, чтобы в стаде был как минимум один бык (хехе, размножение).
# Гарантируется, что на выделенную сумму можно купить хотя бы один вариант стада, удовлетворяющий всем условиям.

# Входные данные : в первой строке, указывается размер выделяемой субсидии в тыс. рублей. 
# На второй строке – количество голов скота, которое надо купить.

# Выходные данные : cтроки, описывающие состав стада – количество быков, коров и телят, которые могут быть куплены.

# Пример:
# Ввод                                                             Вывод
# 560
# 100                                                              1 9 90
#                                                                  2 6 92
#                                                                  3 3 94
#                                                                  4 0 96


# 520
# 100                                                              1 1 98