# Задача 5. Уровень - даешь Биллу Гейтсу в долг.
# Условие: Ну все, пора задумываться о покупке собственной планеты.
# Вам  очень понравилось летать по разным планетам, с целью выбора подходящей.
# За последнее время Вы сделали облет планет  n раз. К сожалению, в последнее время Вы начали замечать,
# что Ваш выбор планет не отличается разнообразием. Вам хочется это исправить, и поэтому Вы провели
# следующее исследование.
# Сначала Вы присвоили каждой планете индивидуальный номер. Затем Вы выписали в ряд все номера планет,
# на которых бывали, в порядке посещения.
# Теперь хочется найти такую планету, что последний раз Вы на ней были раньше последних посещений всех остальных
# планет. Иными словами, Вы хотите найти планету, на которой не были дольше всего на текущий момент.

# Входные данные : в первой строке находится натуральное число n — количество выписанных Вами номеров планет.
# Во второй строке находятся n целых чисел a1, a2, a3...,an — номера планет в порядке посещения. 
# Вы могли посетить одну и ту же планету несколько раз. 
# Обратите внимание, не обязательно, что планеты пронумерованы подряд.

# Выходные данные: выведите одно число — номер планете, на которой Вы не были как можно дольше.

# Пример: 
# Ввод                                                              Вывод
# 5
# 1 3 2 1 2                                                         3


# 6
# 2 1 2 2 4 1                                                       2
