"""

Задача 3. Уровень - родственник Пифагора.
Условие: определить, является ли треугольник прямоугольным.

Ввходные данные: 3 целых числа ( > 0 ) - стороны треугольинка a, b, c

Выходные данные: YES если из этих сторон возможно собрать прямоугольный треугольник.
                 NO - если невозможно.


Пример:
Ввод:                                     Вывод:
1 2 3                                     NO


2 1 3                                     NO


3 4 5                                     YES


4 3 5                                     YES


10 6 8                                    YES

"""
