#Пробная домашняя работа. Не идет в зачет.


# Задача: подсчитать сумму квадратов введенных пользователем чисел (введенных во входной поток).

# Входные данные: 2 целых числа  A и B (A > 0, B >0). Каждое число вводится на новой строке.

# Выходные данные: Сумма квадратов чисел A и B.


# Пример:
#test 1
#Вход:                                                            Выход:
# 3
# 4                                                               25

#test 2
#Вход:                                                            Выход:
# 6
# 8                                                               100

#test 3
#Вход:                                                            Выход:
# 1
# 2                                                               5