// Задание 3. Уровень - мастер пирамид из собак.

// Условие: На вход программе поступает натуральное число (A > 0) - высота пирамиды.
// Требуется вывести пирамиду из символов "@" указанной высоты.

// Входные данные : натуральное число A.
// Выходные данные: пирамида из символов "@" высоты A.


// Пример:
// Ввод:                                                    Вывод:
// 5                                                            @
//                                                             @@@
//                                                            @@@@@
//                                                           @@@@@@@
//                                                          @@@@@@@@@
