// Задание 2. Уровень - фермер.

// Условие: Для восстановления сельского хозяйства государство выделяет целевые субсидии 
// на покупку скота начинающим фермерам. Выделяемая сумма определяется для каждого 
// региона отдельно, при этом устанавливается точное количество голов скота, которое надо приобрести. 
// Цены следующие: бык – 20 тыс. рублей, корова - 10 тыс. рублей, а теленок – 5 тыс. рублей. 
// Выделяемую сумму необходимо потратить полностью, иначе финансы сгорят.

// Выведите все возможные варианты стада, которое может купить начинающий фермер на эту сумму. 
// Обратите внимание, что для развития хозяйства необходимо, чтобы в стаде был как минимум один бык. 
// Гарантируется, что на выделенную сумму можно купить хотя бы один вариант стада, удовлетворяющий всем 
// условиям.

// Входные данные : В первой строке, указывается размер выделяемой субсидии в тыс. рублей. 
// На второй строке – количество голов скота, которое надо купить.

// Выходные данные :  Строки, описывающие состав стада – количество быков, коров и телят, 
// которые могут быть куплены.

// Пример:
// Ввод :                                                         Вывод:
// 580
// 80                                                             1 33 46
//                                                                2 30 48
//                                                                3 27 50
//                                                                4 24 52
//                                                                5 21 54
//                                                                6 18 56
//                                                                7 15 58
//                                                                8 12 60
//                                                                9 9 62
//                                                                10 6 64
//                                                                11 3 66
//                                                                12 0 68


// 600
// 100                                                           1 17 82
//                                                               2 14 84
//                                                               3 11 86
//                                                               4 8 88
//                                                               5 5 90
//                                                               6 2 92 



