// Задача 5. Уровень - мощный математик.

// Условие: На вход программе попадает число A ( > 0).
// Необходимо подсчитать сумму двух БЛИЖАЙШИХ (el1 >= A >= el2, el1+ el2, где el1 и el2 элементы последовательности Фибоначи)
// к этому числу элементов последовательности Фибоначи.

// Входные данные: число A ( > 0), целое
// Выходные данные: сумма ближайших к этому числу элементов последовательности Фибоначи.

// Пример:
// Ввод:                                             Вывод:
// 9                                                 21

// 24                                                55

// 4                                                 8
