// Задание 6. Уровень - Кодзима, ты ли это?
// Условие: вы создали игру в жанре шутер. Теперь ваш дизайнер придумал новое неизвестное никому оружее - дробовик.
// Известно, что дробовики стреляют дробью (внезапно, правда?). Ваша задача - рассчитать суммарный урон, наненсенный 
// выстрелом из дробовика.


// Входные данные : Сначала вводится количество дробинок.
// Затем урон от каждой дробинки. Урон от каждой дробинки выражается простой дробью, 
// её числитель и знаменатель вводятся на отдельных строках.

// Выходные данные : Суммарный урон, выраженный простой несократимой дробью с дробной 
// чертой между числителем и знаменателем.


// Пример:
// Ввод:                                               # Вывод:
// 2
// 1
// 50
// 3
// 20                                                 17/100


// 3
// 1
// 50
// 2
// 40
// 3 
// 30                                                 17/100

  