# Задача 6.  Уровень - кодер из BestPractice.

# Условие: Расширяем горизонты влияния. В этой задаче требуется решить task5 на языке программирования Rust.

# Входные данные: число A ( > 0), целое
# Выходные данные: сумма ближайших к этому числу элементов последовательности Фибоначи.

# Пример:
# Ввод:                                             Вывод:
# 9                                                 21

# 24                                                55

# 4                                                 8