# Задание 4. Уровень - Астерикс и Питоникс.
# Условие: В небольшей деревушке в районе садового кольца живет поселение Галлов. Сегодня бравый Абеликс решил взять отгул,
# и отправился по своим гальским делам. Вам предстоит вместе с Астериксом оборонять деревню. Ибо ты - Питоникс,
# упал в котел с PHP , когда был маленький.

# Жуткий Цезарь пишет письма своей армии, зашифрованные следующим образом. Сначала выбирается шаг шифрования (натуральное число),
#  а затем все буквы послания заменяются на буквы, отстоящие от них в алфавите на шаг шифрования. 
# Например, при шаге шифрования 3, буква А заменяется на букву Г, буква Б – на букву Д.

# Вы знаете, что алфавит «зациклен», то есть при сдвиге буквы Я на шаг 3 получится буква В.
#
# Вам удалось научиться перехватывать послания армиии Цезаря и узнавать шаг шифрования, осталось их расшифровать. Вся деревня надеется на тебя, Питоникс!
# Не подведи!


# Входные данные: Две строки. Первая содержит шаг шифрования (целое число), вторая - зашифрованное послание.

# Выходные данные: расшифрованное сообщение.

# Пример
# Ввод                                                       Вывод
# -3
# ГДЕ                                                        АБВ

# -5
# Те йзухк чхезе, те чхезк йхузе!                            На дворе трава, на траве дрова!


# ВАЖНОЕ ЗАМЕЧАНИЕ : считаем, что буквы ё не существует