# Задание 6. Уровень - ура, опять плюсы!
# Условие: Вам кажется, что решение одной из прошлых задач не такое уж и эффективное.
# И Вам (добровольно) приходит в голову мысль :перенести решение задачи task3.py на язык С++.
# Ну что ж поделать, такой Вы выдумщик.


# Входные данные: произвольный текст.

# Выходные данные: таблица с частотами символов. 
# Таблица должна быть отсортирована по убыванию частот, в случае равных частот — в алфавитном порядке. 
# Если в тексте нет алфавитных символов - выводим перенос строки.

# Пример:
# Ввод:                                      # Вывод:
# hello, world!                              l: 3
#                                            o: 2
#                                            d: 1
#                                            e: 1
#                                            h: 1
#                                            r: 1
#                                            w: 1